{
  "data": {
    "20.0": {
      "20.0.972": {
        "category": {
          "ui": [
            "Pixel inspectors in the 2D and 3D viewers now display the pixel's exposure value (Ev) alongside luminance."
          ]
        }
      },
      "20.0.975": {
        "category": {
          "otl": [
            "Fixed issue where hotl -C would fail to include the HDA's contents."
          ],
          "sop": [
            "The minimum brush radius for Texture Mask Paint has been reduced to 1e-6."
          ]
        }
      }
    },
    "20.5": {
      "20.5.495": {
        "category": {
          "vk": [
            "Renaming a MaterialX VOP network will no longer cause the material to lose all its textures."
          ]
        }
      },
      "20.5.496": {
        "category": {
          "vk": [
            "Fix polysurface primitives potentially using wrong material, when default material is assigned",
            "RGBA images from COPs used as viewport textures are now properly flagged as requiring a transparency pass, so they appear correctly in all transparency modes."
          ]
        }
      },
      "20.5.499": {
        "category": {
          "crowd": [
            "Fixed a bug in the Agent Vellum Unpack SOP where pre-rolling from a rest clip produced incorrect poses when an input agent was blending between multiple clips (e.g. during a clip transition)."
          ],
          "general": [
            "Cryptomatte data planes now always write out oiio:ColorSpace attribute with the data role to prevent them from being inadvertently color-managed in comp."
          ],
          "sop": [
            "Fixed a crash in the AttribCopy SOP when the same name is used for both a point and vertex attribute."
          ]
        }
      },
      "20.5.500": {
        "category": {
          "cop": [
            "Fix a crash when a image layer over 4 billion bytes is flushed from the GPU."
          ],
          "general": [
            "Fixed an issue where Houdini would crash if no valid collision velocity field was passed to the FLIP solver with multigrid preconditioner enabled when running the guided ocean shelf tool."
          ],
          "karma": [
            "A warning is now output from both \"hgpuinfo -l\" and Karma XPU if the CUDA_VISIBLE_DEVICES envvar is detected"
          ],
          "ui": [
            "Pixel inspectors in the 2D and 3D viewers now display the pixel's exposure value (Ev) alongside luminance."
          ],
          "unreal": [
            "Ensure internal session data is cleared when the plugin connects to a new Houdini session."
          ]
        }
      },
      "20.5.501": {
        "category": {
          "ui": [
            "Fixed a bug in the Qt 6 build where opening the node recipes dialog produced Python errors.",
            "Fixed a bug where undo and redo did not work in the Edit Parameter Interface window."
          ]
        }
      },
      "20.5.502": {
        "category": {
          "karma": [
            "Fixed a bug where background plate material with partial opacity would crash under variance convergence mode."
          ],
          "otl": [
            "Fixed issue where hotl -C would fail to include the HDA's contents."
          ],
          "sop": [
            "The minimum brush radius for Texture Mask Paint has been reduced to 1e-6."
          ],
          "ui": [
            "Fixed a bug in the Qt 6 build that caused the Houdini user interface to draw incorrectly on some Linux systems."
          ],
          "unreal": [
            "Fixed an issue where connecting to a new session would incorrecly clear input index."
          ],
          "vk": [
            "Fixed a bug where a per-instance primvar used for Base Color would cause instances not to render in the Vulkan viewport, or to render without applying the correct color",
            "Fixed a bug where primitive picking on polygon surfaces in wireframe mode would always behave as if \"Select Wireframe Surfaces as if Solid\" was enabled"
          ]
        }
      },
      "20.5.503": {
        "category": {
          "apex": [
            "Fixed a bug where the last key was lost when merging APEX Animation Layers."
          ]
        }
      }
    }
  }
}
